/*======================================================================
課程範例:
FROM 可不可以不接 TABLE
------------------------------------
有時可能程序運作時, 需要參照小型的臨時表
例如:
======================================================================*/
use ColinDemo;
go

/*----------------------------------------
程序中臨時需要一個小型的表格做處理
例如一個小型的數值清單
一般會建實體表, temp table, 或是變數表
這裡舉例用實體表
----------------------------------------*/
drop table if exists dbo.PhysicalTable;
create table dbo.PhysicalTable
(MyNumber int);

insert into dbo.PhysicalTable (MyNumber)
VALUES (1),(2),(3),(4),(5);

select PhysicalTable.MyNumber 
from dbo.PhysicalTable;
go


/*----------------------------------------
這時可以用......

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/



/*----------------------------------------
可以用在 FROM 的話, 那可以用在 JOIN 嗎? 
可以的, 但有限制是他本身就是使用 alias name
所以不能再給別名了

例如有一個查詢如下
PS. 如果你的AdventureWorks是別的版本, 
    請自行調整filter條件以符合該版本
----------------------------------------*/
use AdventureWorks2025;
go

select 
	*
from 
	Sales.SalesOrderHeader as soh
join 
	Sales.SalesOrderDetail as sod
	on soh.SalesOrderID = sod.SalesOrderID
where 
	soh.ShipDate between '2024-01-01' and '2025-12-31';



/*----------------------------------------
上述的查詢, 若要加入 sod.ProductID 符合
860,994,917,708,831, 同時計劃用 JOIN 的話
可以使用......

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/




/*--------------------------------------------------------------------*/

/*----------------------------------------
來做一個三個欄位, FirstName, LastName, Birthday

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/




/*----------------------------------------
移除測試資料
use ColinDemo;
go

drop table if exists dbo.PhysicalTable;
----------------------------------------*/

/*-----END-----*/