/*======================================================================
課程範例:
EXISTS 真的 EXISTS 嗎?
------------------------------------
這個範例說明在使用 EXISTS 時要注意的事項
多數是無法預期的回值而導致程序邏輯的錯誤
======================================================================*/
use ColinDemo;
go

/*----------------------------------------
建立測試資料表 dbo.SelectExistsDemo
並且只寫入一筆測試資料
----------------------------------------*/
drop table if exists dbo.SelectExistsDemo;
create table dbo.SelectExistsDemo
(A int, B int);
go

insert into dbo.SelectExistsDemo
values (999, -999);
go


/* 檢視資料 */
select * from dbo.SelectExistsDemo;
go


/*--------------------------------------------------------------------*/

/*----------------------------------------
測試各種 EXISTS 的情境, 主要使用以下的範例程式碼
請依照課程中的說明, 複製程式碼進行改寫與測試

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/

select N'執行未報錯 - EXISTS *      ' where exists (select *       from SelectExistsDemo);
go


/*====================================================================*/

/*----------------------------------------
接下來看權限的配置
若是某一個使用者對資料表的其中一個欄位沒有權限時
會發生什麼狀況?
----------------------------------------*/

/*----------------------------------------
建立使用者並給予權限
----------------------------------------*/
create user DenyColumnB without login;
grant select on SelectExistsDemo    to DenyColumnB;
DENY  select on SelectExistsDemo(B) to DenyColumnB;
go


/*----------------------------------------
使用DenyColumnB的使用者來測試
----------------------------------------*/
execute as user = 'DenyColumnB';
select current_user as CurrentUser;
/* 這裡會提示使用者為DenyColumnB */
go


/*----------------------------------------
測試各種 EXISTS 的情境, 主要使用以下的範例程式碼
請依照課程中的說明, 複製程式碼進行改寫與測試

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/

select N'執行未報錯 - EXISTS *      ' where exists (select *       from SelectExistsDemo);
go


/*----------------------------------------
還原測試使用者權限配置
----------------------------------------*/
revert;
select current_user as CurrentUser;
go


/*----------------------------------------
移除測試使用者權限
----------------------------------------*/
drop user DenyColumnB;
go



/*----------------------------------------
移除測試資料
use ColinDemo;
go

drop table if exists dbo.SelectExistsDemo;
----------------------------------------*/

/*-----END-----*/