/*======================================================================
課程範例:
令人頭昏的 OR
------------------------------------
在 WHERE 條件中, 當看到一堆 OR 條件時, 請留意
* 各條件是否都是能被判斷的
* 測試各條件是否能帶出你想要的正確資料
OR 不是誤判, 而是語法中的條件可能讓你的想法誤判了
======================================================================*/

use ColinDemo;
go


/*----------------------------------------
令人頭昏的 OR 的所有範程程式碼都是相當輕量的
並且編寫第一個後, 用複製的方式做修改即可向下進行

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/



/*----------------------------------------
移除測試資料

----------------------------------------*/

/*-----END-----*/