/*======================================================================
課程範例:
能用 WHERE 1 = 1 嗎
------------------------------------
當使用 WHERE 1 = 1 的方式, 有人說會影響效能
但這個方式能在開發過程中減少對 WHERE 子句做組字串時的困難

那麼, 到底使用 WHERE 1 = 1 會有什麼影響呢
======================================================================*/
use AdventureWorks2025;
go


/*----------------------------------------
測試用的範例語法, 可以由此做複製與修改
----------------------------------------*/
select
	soh.SalesOrderID,
	sod.SalesOrderDetailID,
	soh.SalesOrderNumber
from
	Sales.SalesOrderHeader as soh
join
	Sales.SalesOrderDetail as sod
	on sod.SalesOrderID = soh.SalesOrderID
where
		sod.SalesOrderDetailID > 2000
	and soh.SalesOrderID between 50000 and 59999;
go



/*----------------------------------------
要修改的語法不複雜, 加 1 = 1 與 使用 AND / OR 的動作

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/

/*----------------------------------------
測試 1, 使用 1 = 1 與沒有使用 1 = 1 的差異
----------------------------------------*/


/*--------------------------------------------------------------------*/

/*----------------------------------------
測試 2, 使用 1 = 1 在 AND 與 OR 的差異
----------------------------------------*/




/*----------------------------------------
移除測試資料

----------------------------------------*/

/*-----END-----*/