/*======================================================================
課程範例:
CASE WHEN 也會令人困擾
------------------------------------
官方文件提到的三個重點
* 如果沒有比較作業評估為 TRUE，則傳回的運算式。 如果省略此引數，且沒有比較作業評估為 TRUE， CASE 則會傳回 NULL。
* 依指定的順序，評估每個 WHEN 子句的 input_expression = when_expression。
  OR 傳回第一個評估為 的Boolean_expression的TRUE。
* 您也必須確定 or THEN ELSE 子句中至少有一個運算式不是 NULL 常數。
======================================================================*/
use ColinDemo;
go


/*----------------------------------------
CASE WHEN 是有順序性的
CASE WHEN 中若第一個條件成立時
就不會判斷第二個條件, 以此類推...
----------------------------------------*/

/*----------------------------------------
請依照課程中的說明進行各項語法的編寫與測試

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/


/*--------------------------------------------------------------------*/

use ColinDemo;
go

/*----------------------------------------
建立範例資料
----------------------------------------*/
drop table if exists Demo_Case_When_WITHOUT_Else;
create table Demo_Case_When_WITHOUT_Else
(id int, MyData varchar(20));
go

insert into Demo_Case_When_WITHOUT_Else (id, MyData)
values (1, 'A'), (2, 'B'), (3, 'C'), (4, 'D');
go


/*----------------------------------------
使用 CASE WHEN 的方式更新資料
但沒有使用 ELSE
----------------------------------------*/
update u
set u.MyData = 
    CASE id 
        WHEN 1 THEN 'X'
        WHEN 2 THEN 'Y'
        /* 沒有 ELSE */
        --ELSE MyData
    END
from Demo_Case_When_WITHOUT_Else as u;

/* 檢查資料 */
select * from Demo_Case_When_WITHOUT_Else;


/*----------------------------------------
二個針對 NULL 要留意的地方
----------------------------------------*/

/*----------------------------------------
請依照課程中的說明進行各項語法的編寫與測試

範例語法不複雜, 請依課程內容自行編寫 (課堂練習作業)
----------------------------------------*/



/*----------------------------------------
移除測試資料

use ColinDemo;
go
drop table if exists Demo_Case_When_WITHOUT_Else;
----------------------------------------*/

/*-----END-----*/
